app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ulises"], ["password", "123456"], ["created_at", 2016-11-18 00:18:09 UTC], ["updated_at", 2016-11-18 00:18:09 UTC]]
---
  def create
    @author = Author.new(author_params)

    if @author.save