app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @book = Book.find(params[:id])
    if @book.author.name != session[:author]
      redirect_to books_path, :alert => "No puedes editar un libro de otro autor"
    else
      @book = Book.find(params[:id])

SELECT  "authors".* FROM "authors" WHERE "authors"."name" = ? LIMIT ?  [["name", "ulises"], ["LIMIT", 1]]
INSERT INTO "books" ("title", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "La calle de las amarguras"], ["author_id", 1], ["created_at", 2016-11-18 00:21:38 UTC], ["updated_at", 2016-11-18 00:21:38 UTC]]
---
  def create
    @book = Book.new(book_params)
    @book.author = Author.find_by name: session[:author]

    respond_to do |format|
      if @book.save

UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "a"], ["updated_at", 2016-11-18 00:23:04 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
    if @book.author.name != session[:author]
      redirect_to books_path, :alert => "No puedes eliminar el libro de otro autor"
    else
      @book.destroy