app/controllers/session_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."name" = ? LIMIT ?  [["name", "ulises"], ["LIMIT", 1]]
---
  def create
    @author = Author.find_by name:  params[:username]